       IDENTIFICATION DIVISION.
       PROGRAM-ID.   DESAFIO02VALORES.
       AUTHOR.       JEFF LUCAS.
       DATE-WRITTEN. JUN2021.
      *OBJETIVO: RECEBER DOIS VALORES, CALCULAR MÉDIA E IMPRIMIR VALORES
      * COM CIFRÃO E VÍRGULAS.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-V1    PIC 9(02)V99 VALUE ZEROS.
       77 WRK-V2    PIC 9(02)V99 VALUE ZEROS.
       77 WRK-TT    PIC 9(03)V99 VALUE ZEROS.
       77 WRK-TT-OK PIC $ZZ9,99.
       77 WRK-MD    PIC $ZZ9,99.
       PROCEDURE DIVISION.
           DISPLAY 'INFORME VALOR VENDA 1:'.
           ACCEPT WRK-V1 FROM CONSOLE.
           DISPLAY 'INFORME VALOR VENDA 2:'.
           ACCEPT WRK-V2 FROM CONSOLE.
           ADD WRK-V1 WRK-V2 TO WRK-TT.
           MOVE WRK-TT TO WRK-TT-OK.
           DISPLAY 'TOTAL DE VENDAS: ' WRK-TT-OK.
           COMPUTE WRK-MD = (WRK-V2 + WRK-V1) / 2.
           DISPLAY 'MEDIA DE VENDAS: ' WRK-MD.
           STOP RUN.
