       IDENTIFICATION DIVISION.
       PROGRAM-ID.   PROGCOB07.
       AUTHOR.       JEFF LUCAS.
       DATE-WRITTEN. JUN2021.
      *OBJETIVO: RECEBER DUAS NOTAS, CALCULAR MÉDIA E IMPRIMIR SENTENÇA
      *CONDICIONAL. USAR IF/ELSE/END-IF.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-N1    PIC 9(02)V99 VALUE ZEROS.
       77 WRK-N2    PIC 9(02)V99 VALUE ZEROS.
       77 WRK-MEDIA PIC 9(02)V99 VALUE ZEROS.
       PROCEDURE DIVISION.
           DISPLAY 'INFORME NOTA 1'.
           ACCEPT WRK-N1 FROM CONSOLE.
           DISPLAY 'INFORME NOTA 2'
           ACCEPT WRK-N2 FROM CONSOLE.
           COMPUTE WRK-MEDIA = (WRK-N1 + WRK-N2) / 2.
           DISPLAY 'MEDIA: ' WRK-MEDIA.
           IF WRK-MEDIA >= 7
               DISPLAY 'APROVADO'
           ELSE
               IF WRK-MEDIA >= 4
                   DISPLAY 'RECUPERACAO'
               ELSE
                   DISPLAY 'REPROVADO'
               END-IF
           END-IF.
           STOP RUN.
