      ***********************
      * AUTHOR:  JEFF LUCAS
      * DATE:    JUN 2021
      * PURPOSE: RECEBER E IMPRIMIR UMA STRING
      ***********************

       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB02.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOME PIC X(20) VALUE SPACES.
       PROCEDURE DIVISION.
           ACCEPT WRK-NOME FROM CONSOLE.
           DISPLAY 'NOME INFORMADO: ' WRK-NOME(1:4).
           STOP RUN.
