       IDENTIFICATION DIVISION.
       PROGRAM-ID.   PROGCOB06.
       AUTHOR.       JEFF LUCAS.
       INSTALLATION. NOTDEFINED.
       DATE-WRITTEN. JUN2021.
       REMARKS.      OBJETIVO: COMPRENDER SINAIS ARITMETICOS.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-N1           PIC 9(02) VALUE ZEROS.
       77 WRK-N2           PIC 9(02) VALUE ZEROS.
       77 WRK-RESULTADO    PIC S9(03) VALUE ZEROS.
       77 WRK-RESULTADO-ED PIC -ZZ9.
       PROCEDURE DIVISION.
           DISPLAY 'INFORME N1: '.
           ACCEPT WRK-N1 FROM CONSOLE.
           DISPLAY 'INFORME N2: '
           ACCEPT WRK-N2 FROM CONSOLE.
           DISPLAY '-=-=-=-=-=-=-=-=-=-=-=-=-'
           SUBTRACT WRK-N1 FROM WRK-N2 GIVING WRK-RESULTADO.
           MOVE WRK-RESULTADO TO WRK-RESULTADO-ED.
           DISPLAY 'RESULTADO: ' WRK-RESULTADO.
           DISPLAY 'RESULTADO EDITADO: ' WRK-RESULTADO-ED.
           STOP RUN.
