       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB09.
      **************************************
      * AUTHOR:   JEFF LUCAS               *
      * DATE:     JUN 2021                 *
      * OBJETIVO: UTILIZAR O EVALUATE      *
      **************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
