      ****************************************
      * AUTHOR: JEFF LUCAS
      * DATE:   2021
      ****************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTE01.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "Hello world"
           STOP RUN.
       END PROGRAM TESTE01.
